adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    float yaw_proportional;
    float yaw_integral;
    float yaw_derivative;
    bool yaw_output_saturated;
    bool yaw_integral_saturated;

    // Calibration Debug Section
    bool imu_cal_active;
    float roll_cal_offset;
    float pitch_cal_offset;

    // Motor Mix Section
    int base_pwm;
    int motor1_final;
    int motor2_final;
    int motor3_final;
    int motor4_final;
    float motor1_offset;
    float motor2_offset;
    float motor3_offset;
    float motor4_offset;

    // Inputs Section
    float roll_input;
    float pitch_input;
    float yaw_input;

    // System Section
    bool sensors_ok;
    bool emergency_active;
    bool imu_calibrated;
    unsigned long uptime;
    unsigned int free_heap;

    // Update timestamp
    unsigned long timestamp;
};

MotorOutputs motorOutputs;

// Debug data for web dashboard
DebugData debugData;

// Motor calibration offsets to compensate for mechanical imbalances
// Negative values reduce motor power, positive values increase it
struct MotorCalibration
{
    float motor1_offset; // Front Right (CCW)
    float motor2_offset; // Back Right (CW)
    float motor3_offset; // Front Left (CW) (reduce if left side lifts early)
    float motor4_offset; // Back Left (CCW) (reduce if left side lifts early)
};

// Motor calibration offsets (applied only in MANUAL mode). Defaults to zero.
MotorCalibration motorCal = {
    .motor1_offset = 0.0, // Front Right (CCW)
    .motor2_offset = 0.0, // Back Right (CW)
    .motor3_offset = 0.0, // Front Left (CW)
    .motor4_offset = 0.0  // Back Left (CCW)
};

// =====================================
// Unified Motor Mixing (Matches droneFreeRTOS)
// =====================================
// Tunable mixer gains (μs contribution at full normalized input |R|=|P|=|Y|=1)
// Keep identical to droneFreeRTOS for consistent tuning behavior across builds.
float MIX_KR = 200.0f; // Roll gain
float MIX_KP = 200.0f; // Pitch gain
float MIX_KY = 150.0f; // Yaw gain

// =====================================
// Live-tunable control enhancement variables (mirroring droneFreeRTOS)
// =====================================
float manualAxisGain = 1.30f; // Extra authority in manual mode (scales stick R/P/Y)
float throttleGate = 0.35f;   // Below this throttle, disable PID integrators (and optionally entire PID)
float slewRateRP = 180.0f;    // deg/sec max change for roll/pitch angle setpoints (slew limiter)
float slewRateYaw = 360.0f;   // deg/sec^2 equivalent for yaw rate command smoothing (simplified)
float yawFeedForward = 0.15f; // Fraction of yaw setpoint added directly to yaw PID output

// Advanced fusion/control feature toggles (default off to preserve current behavior)
bool USE_KALMAN_ATTITUDE = false;     // If true, use 1D Kalman filter for roll/pitch angles
bool USE_CASCADED_ANGLE_RATE = false; // If true, use angle->rate cascaded loops for roll/pitch

// Cascaded inner rate PID controllers (roll/pitch); yaw already rate-controlled by yawPID
PIDController rollRatePID, pitchRatePID;

// Rate PID tunables and limits
struct RatePIDParams
{
    double roll_kp, roll_ki, roll_kd;
    double pitch_kp, pitch_ki, pitch_kd;
};

RatePIDParams ratePidParams = {
    // conservative defaults; tune live via dashboard
    .roll_kp = 0.10,
    .roll_ki = 0.02,
    .roll_kd = 0.002,
    .pitch_kp = 0.10,
    .pitch_ki = 0.02,
    .pitch_kd = 0.002};

float MAX_ROLL_PITCH_RATE = 180.0f; // deg/s limit for outer angle loop output (desired rate)

// 1D Kalman filter state for attitude (roll/pitch)
struct Kalman1D
{
    float x; // angle estimate (deg)
    float p; // estimate variance
    bool initialized;
} kalmanRoll = {0, 1, false}, kalmanPitch = {0, 1, false};

// Kalman noise parameters (tunable via dashboard)
float KALMAN_RATE_STD = 4.0f; // deg/s (gyro rate noise std)
float KALMAN_MEAS_STD = 3.0f; // deg (accel angle noise std)

// Slew limiter state
static float prevRollSetpointCmd = 0.0f;
static float prevPitchSetpointCmd = 0.0f;
static float prevYawRateCmd = 0.0f;
static unsigned long prevSlewTimeMs = 0;

// ESC pulse bounds (use existing defines)
#ifndef PWM_MIN_PULSE
#define PWM_MIN_PULSE MOTOR_MIN
#endif
#ifndef PWM_MAX_PULSE
#define PWM_MAX_PULSE MOTOR_MAX
#endif

// Scaled mixer applying dynamic saturation management (same algorithm as droneFreeRTOS)
// Writes directly into motorOutputs.*
static inline void applyScaledMotorMix(float baseMicros, float Rn, float Pn, float Yn)
{
    // Constrain base
    if (baseMicros < PWM_MIN_PULSE)
        baseMicros = PWM_MIN_PULSE;
    if (baseMicros > PWM_MAX_PULSE)
        baseMicros = PWM_MAX_PULSE;

    // Raw mixes (direction pattern identical to droneFreeRTOS M1..M4 order)
    float m1 = -MIX_KR * Rn - MIX_KP * Pn + MIX_KY * Yn; // Front Right (CCW)
    float m2 = -MIX_KR * Rn + MIX_KP * Pn - MIX_KY * Yn; // Back Right (CW)
    float m3 = MIX_KR * Rn - MIX_KP * Pn - MIX_KY * Yn;  // Front Left (CW)
    float m4 = MIX_KR * Rn + MIX_KP * Pn + MIX_KY * Yn;  // Back Left (CCW)

    // Find mix extremes
    float posMax = 0.0f, negMin = 0.0f;
    float mixes[4] = {m1, m2, m3, m4};
    for (int i = 0; i < 4; ++i)
    {
        if (mixes[i] > posMax)
            posMax = mixes[i];
        if (mixes[i] < negMin)
            negMin = mixes[i];
    }

    float s_pos = 1.0f;
    float s_neg = 1.0f;
    if (posMax > 0.0f)
    {
        float headroomHigh = PWM_MAX_PULSE - baseMicros;
        if (headroomHigh < 0)
            headroomHigh = 0;
        s_pos = headroomHigh / posMax;
        if (s_pos > 1.0f)
            s_pos = 1.0f;
    }
    if (negMin < 0.0f)
    {
        float headroomLow = baseMicros - PWM_MIN_PULSE;
        if (headroomLow < 0)
            headroomLow = 0;
        s_neg = headroomLow / (-negMin);
        if (s_neg > 1.0f)
            s_neg = 1.0f;
    }

    // Apply scaling
    float f1 = baseMicros + (m1 >= 0 ? s_pos * m1 : s_neg * m1);
    float f2 = baseMicros + (m2 >= 0 ? s_pos * m2 : s_neg * m2);
    float f3 = baseMicros + (m3 >= 0 ? s_pos * m3 : s_neg * m3);
    float f4 = baseMicros + (m4 >= 0 ? s_pos * m4 : s_neg * m4);

    // Clamp
    if (f1 < PWM_MIN_PULSE)
        f1 = PWM_MIN_PULSE;
    if (f1 > PWM_MAX_PULSE)
        f1 = PWM_MAX_PULSE;
    if (f2 < PWM_MIN_PULSE)
        f2 = PWM_MIN_PULSE;
    if (f2 > PWM_MAX_PULSE)
        f2 = PWM_MAX_PULSE;
    if (f3 < PWM_MIN_PULSE)
        f3 = PWM_MIN_PULSE;
    if (f3 > PWM_MAX_PULSE)
        f3 = PWM_MAX_PULSE;
    if (f4 < PWM_MIN_PULSE)
        f4 = PWM_MIN_PULSE;
    if (f4 > PWM_MAX_PULSE)
        f4 = PWM_MAX_PULSE;

