adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    pitchPID.initialize(pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd, -400, 400);
    pitchPID.setDerivativeFilter(0.1);   // Reduce noise
    pitchPID.setSetpointSmoothing(0.05); // Smooth setpoint changes

    yawPID.initialize(pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd, -200, 200);
    yawPID.setDerivativeFilter(0.15); // More filtering for yaw (noisier)
    yawPID.setSetpointSmoothing(0.1); // More smoothing for yaw commands

    altitudePID.initialize(pidParams.altitude_kp, pidParams.altitude_ki, pidParams.altitude_kd, 0, 1000);
    altitudePID.setDerivativeFilter(0.05);  // Light filtering for altitude
    altitudePID.setSetpointSmoothing(0.02); // Gentle altitude setpoint changes

    // Initialize inner rate PIDs (disabled by default unless cascaded enabled)
    rollRatePID.initialize(ratePidParams.roll_kp, ratePidParams.roll_ki, ratePidParams.roll_kd, -400, 400);
    rollRatePID.setDerivativeFilter(0.2);
    rollRatePID.setSetpointSmoothing(0.05);
    pitchRatePID.initialize(ratePidParams.pitch_kp, ratePidParams.pitch_ki, ratePidParams.pitch_kd, -400, 400);
    pitchRatePID.setDerivativeFilter(0.2);
    pitchRatePID.setSetpointSmoothing(0.05);

    Serial.println("Custom PID controllers initialized with advanced features:");
    Serial.println("- Anti-windup protection");
    Serial.println("- Derivative filtering");
    Serial.println("- Setpoint smoothing");
    Serial.println("- Output saturation protection");
    Serial.printf("PID Gains - Roll: P=%.2f I=%.2f D=%.3f, Pitch: P=%.2f I=%.2f D=%.3f, Yaw: P=%.2f I=%.2f D=%.3f\n",
                  pidParams.roll_kp, pidParams.roll_ki, pidParams.roll_kd,
                  pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd,
                  pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd);
    Serial.printf("Rate PID Gains - RollRate: P=%.2f I=%.2f D=%.3f, PitchRate: P=%.2f I=%.2f D=%.3f\n",
                  ratePidParams.roll_kp, ratePidParams.roll_ki, ratePidParams.roll_kd,
                  ratePidParams.pitch_kp, ratePidParams.pitch_ki, ratePidParams.pitch_kd);
}

void connectWiFi()
{
    WiFi.begin(ssid, password);
    Serial.print("Connecting to WiFi");

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20)
    {
        delay(500);
        Serial.print(".");
        attempts++;
    }

    if (WiFi.status() == WL_CONNECTED)
    {
        Serial.println();
        Serial.print("WiFi connected! IP: ");
        Serial.println(WiFi.localIP());
    }
    else
    {
        Serial.println();
        Serial.println("WiFi connection failed!");
    }
}

// We'll continue with the task implementations in the next part...

// ================================
// FREERTOS TASK IMPLEMENTATIONS
// ================================

void controlTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(CONTROL_LOOP_PERIOD);

    Serial.println("Control Task started - Running at 100Hz");

    while (true)
    {
        // Wait for the next cycle
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Check safety conditions first
        checkSafetyConditions();

        if (flightState.emergency_stop)
        {
            handleEmergency();
            continue;
        }

        // Update flight mode based on inputs
        updateFlightMode();

        // Update LED status indicators
        updateStatusLights();
        updateNavigationLights();

        // Comprehensive Debug Data Collection for Web Dashboard
        static int debug_counter = 0;
        if (++debug_counter >= 100)
        { // Every 1 second at 100Hz for smooth web updates
            debug_counter = 0;

            // Update debug data structure for web dashboard
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(2)) == pdTRUE)
            {
                // Status Section
                switch (flightState.mode)
                {
                case MODE_MANUAL:
                    debugData.flight_mode = "MANUAL";
                    break;
                case MODE_STABILIZE:
                    debugData.flight_mode = "STABILIZE";
                    break;
                case MODE_ALTITUDE_HOLD:
                    debugData.flight_mode = "ALT_HOLD";
                    break;
                case MODE_POSITION_HOLD:
                    debugData.flight_mode = "POS_HOLD";
                    break;
                case MODE_EMERGENCY:
                    debugData.flight_mode = "EMERGENCY";
                    break;
                default:
                    debugData.flight_mode = "DISARMED";
                    break;
                }

                debugData.armed = flightState.motors_armed;
                debugData.throttle_input = controlInputs.throttle;
                debugData.throttle_pwm = mapFloat(controlInputs.throttle, 0.0, 1.0, MOTOR_IDLE, MOTOR_MAX);
                debugData.roll_angle = sensorData.roll_angle;
                debugData.pitch_angle = sensorData.pitch_angle;
                debugData.yaw_rate = sensorData.yaw_rate;
                debugData.altitude = sensorData.altitude_filtered;
                debugData.battery_voltage = sensorData.battery_voltage;

                // PID Debug Section - Enhanced with custom PID diagnostics
                debugData.pid_active = (flightState.mode >= MODE_STABILIZE);
                debugData.pid_enabled_by_throttle = (controlInputs.throttle > throttleGate); // Reflect live throttle gate
                debugData.roll_output = rollPID.output;
                debugData.pitch_output = pitchPID.output;
                debugData.yaw_output = yawPID.output;
                debugData.roll_setpoint = rollPID.setpoint;
                debugData.pitch_setpoint = pitchPID.setpoint;
                debugData.yaw_setpoint = yawPID.setpoint;

                // Advanced PID Diagnostics - Individual P, I, D components and saturation status
                debugData.roll_proportional = rollPID.getProportionalTerm();
                debugData.roll_integral = rollPID.getIntegralTerm();
                debugData.roll_derivative = rollPID.getDerivativeTerm();
                debugData.roll_output_saturated = rollPID.isOutputSaturated();
                debugData.roll_integral_saturated = rollPID.isIntegralSaturated();

                debugData.pitch_proportional = pitchPID.getProportionalTerm();
                debugData.pitch_integral = pitchPID.getIntegralTerm();
                debugData.pitch_derivative = pitchPID.getDerivativeTerm();
                debugData.pitch_output_saturated = pitchPID.isOutputSaturated();
                debugData.pitch_integral_saturated = pitchPID.isIntegralSaturated();

