adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
// ================================
// CORE FLIGHT CONTROL FUNCTIONS
// ================================

void updateSensors()
{
    static unsigned long lastBME280Read = 0;
    static unsigned long lastGPSRead = 0;
    static unsigned long lastBatteryRead = 0;

    // Read IMU data (high frequency)
    sensors_event_t accel, gyro, temp;
    bool imu_success = mpu.getEvent(&accel, &gyro, &temp);

    if (imu_success && xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        sensorData.accel_x = accel.acceleration.x;
        sensorData.accel_y = accel.acceleration.y;
        sensorData.accel_z = accel.acceleration.z;
        // Roll rate: removed previous inversion (was negated) to correct inverted roll response
        sensorData.roll_rate = gyro.gyro.x * 180.0 / PI;
        sensorData.pitch_rate = gyro.gyro.y * 180.0 / PI;
        sensorData.yaw_rate = gyro.gyro.z * 180.0 / PI;
        xSemaphoreGive(sensorMutex);
    }

    // Read BME280 (lower frequency)
    if (millis() - lastBME280Read > 50)
    { // 20Hz
        lastBME280Read = millis();

        float pressure = bme.readPressure();
        if (!isnan(pressure) && pressure > 0)
        {
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                sensorData.pressure = pressure / 100.0;               // Convert to hPa
                sensorData.altitude_baro = bme.readAltitude(1013.25); // Sea level pressure
                sensorData.temperature = bme.readTemperature();
                sensorData.humidity = bme.readHumidity();
                xSemaphoreGive(sensorMutex);
            }
        }
    }

    // GPS reading disabled for now to prevent errors
    /*
    // Read GPS (lower frequency)
    if (millis() - lastGPSRead > 100)
    { // 10Hz
        lastGPSRead = millis();
        // GPS code commented out until Serial2 is properly initialized
    }
    */

    // Read battery (very low frequency)
    if (millis() - lastBatteryRead > 1000)
    { // 1Hz
        lastBatteryRead = millis();

        int rawValue = analogRead(BATTERY_PIN);
        float vOut = (rawValue / 4095.0) * 3.3;

        // For 3S LiPo battery reading - adjust voltage divider ratio
        // If no voltage divider is used, multiply by appropriate factor
        // Common voltage divider: R1=10k, R2=10k (divide by 2) = vOut * 2
        // For 3S LiPo (12.6V max): need divide by ~4, so vOut * 4
        // Empirical correction: 3.4V reading suggests vOut * 3.7 for 12.6V
        float batteryVoltage = vOut * 3.7; // Adjusted for actual hardware setup

        // Debug battery reading every 10 seconds
        static int battery_debug_counter = 0;
        if (++battery_debug_counter >= 10)
        {
            battery_debug_counter = 0;
            Serial.printf("Battery Debug - Raw ADC: %d, vOut: %.2f, Final: %.2f\n", rawValue, vOut, batteryVoltage);
        }

        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
        {
            sensorData.battery_voltage = batteryVoltage;
            // Calculate percentage (3S LiPo: 9.0V-12.6V) - display only
            sensorData.battery_percentage = ((batteryVoltage - 9.0) / (12.6 - 9.0)) * 100.0;
            sensorData.battery_percentage = constrainFloat(sensorData.battery_percentage, 0.0, 100.0);
            xSemaphoreGive(sensorMutex);
        }
    }
}

void calculateOrientation()
{
    static float roll_angle = 0.0;
    static float pitch_angle = 0.0;
    static bool prevCalibrated = false; // Track calibration edge
    static unsigned long lastUpdate = 0;

    unsigned long now = millis();
    float dt = (now - lastUpdate) / 1000.0; // Convert to seconds
    lastUpdate = now;

    if (dt > 0.1)
        dt = 0.1; // Limit dt to prevent large jumps

    // Get current sensor readings (thread-safe)
    float accel_x, accel_y, accel_z;
    float gyro_roll, gyro_pitch;

    if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        accel_x = sensorData.accel_x;
        accel_y = sensorData.accel_y;
        accel_z = sensorData.accel_z;
        gyro_roll = sensorData.roll_rate;
        gyro_pitch = sensorData.pitch_rate;
        xSemaphoreGive(sensorMutex);
    }
    else
    {
        return; // Skip this update if we can't get sensor data
    }

    // Apply IMU calibration offsets if calibrated
    if (imuCal.calibrated)
    {
        accel_x -= imuCal.accel_x_offset;
        accel_y -= imuCal.accel_y_offset;
        accel_z -= imuCal.accel_z_offset;
        // Subtract stored gyro biases (convert stored rad/s to deg/s)
        gyro_roll -= (imuCal.gyro_x_offset * 180.0 / PI);
        gyro_pitch -= (imuCal.gyro_y_offset * 180.0 / PI);
    }

    // Calculate angles from accelerometer
    // Fix roll axis to match physical tilt direction
    // Remove leading negative to align roll angle sign with control input (previous sign caused inverted response)
    float accel_roll = atan2(accel_y, sqrt(accel_x * accel_x + accel_z * accel_z)) * 180.0 / PI;
    float accel_pitch = atan2(-accel_x, sqrt(accel_y * accel_y + accel_z * accel_z)) * 180.0 / PI;

    // Apply calibration offsets to get relative angles from level position
    // Do not subtract additional angle offsets here; accelerometer biases are already
    // compensated above. Additional angle offset subtraction would double-correct and
    // introduce a residual bias when level. The complementary filter is seeded after
    // calibration to ensure the fused attitude starts at level.

    // If calibration was just completed, re-seed the complementary filter state
    // to the level-corrected accelerometer estimate to avoid residual bias.
    if (imuCal.calibrated && !prevCalibrated)
    {
        roll_angle = accel_roll;
        pitch_angle = accel_pitch;
    }
    prevCalibrated = imuCal.calibrated;

    // Fusion: complementary filter or 1D Kalman (optional)
    if (USE_KALMAN_ATTITUDE)
    {
        // Initialize on first use or on calibration edge
        if (!kalmanRoll.initialized || (imuCal.calibrated && !prevCalibrated))
        {
            kalmanRoll.x = accel_roll;
            kalmanRoll.p = 4.0f;
            kalmanRoll.initialized = true;
            kalmanPitch.x = accel_pitch;
            kalmanPitch.p = 4.0f;
            kalmanPitch.initialized = true;
        }
        // Prediction
        float q = (KALMAN_RATE_STD * KALMAN_RATE_STD) * dt; // process noise variance contribution
        kalmanRoll.x += gyro_roll * dt;
        kalmanRoll.p += q;
        kalmanPitch.x += gyro_pitch * dt;
        kalmanPitch.p += q;
        // Measurement update
        float r = (KALMAN_MEAS_STD * KALMAN_MEAS_STD);
        float k_r = kalmanRoll.p / (kalmanRoll.p + r);
        float k_p = kalmanPitch.p / (kalmanPitch.p + r);
        kalmanRoll.x += k_r * (accel_roll - kalmanRoll.x);
        kalmanRoll.p *= (1.0f - k_r);
        kalmanPitch.x += k_p * (accel_pitch - kalmanPitch.x);
        kalmanPitch.p *= (1.0f - k_p);
        roll_angle = kalmanRoll.x;
        pitch_angle = kalmanPitch.x;
    }
    else
    {
        // Complementary filter (combine gyro and accel)
        const float alpha = 0.98; // Gyro weight (higher = trust gyro more)
        roll_angle = alpha * (roll_angle + gyro_roll * dt) + (1.0f - alpha) * accel_roll;
        pitch_angle = alpha * (pitch_angle + gyro_pitch * dt) + (1.0f - alpha) * accel_pitch;
    }

    // Update global sensor data
    if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        sensorData.roll_angle = roll_angle;
        sensorData.pitch_angle = pitch_angle;

        // Simple altitude filtering (combine GPS and barometric)
        if (flightState.gps_available && sensorData.satellites >= 4)
        {
            // Use GPS altitude when available and reliable
            sensorData.altitude_filtered = sensorData.altitude_gps;
        }
        else
        {
            // Fall back to barometric altitude
            sensorData.altitude_filtered = sensorData.altitude_baro;
        }

        xSemaphoreGive(sensorMutex);
    }
}

void runPIDControllers()
{
    // Time delta for slew limiting
    unsigned long nowMs = millis();
    float dt = (prevSlewTimeMs == 0) ? 0.01f : (float)(nowMs - prevSlewTimeMs) / 1000.0f;
    if (dt <= 0)
        dt = 0.01f; // fallback
    prevSlewTimeMs = nowMs;

