adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    // Raw desired commands from sticks (pre-slew)
    // Invert roll stick here to compensate for previous sensor sign convention change
    float desiredRollDeg = (controlInputs.roll) * 30.0f; // +/-30°
    float desiredPitchDeg = controlInputs.pitch * 30.0f; // +/-30°
    float desiredYawRate = controlInputs.yaw * 180.0f;   // +/-180°/s (rate)

    // Apply calibration reference if IMU calibrated (angles already relative in sensorData)
    // Slew limit roll/pitch setpoints
    float maxDeltaRP = slewRateRP * dt; // deg change allowed this cycle
    float deltaR = desiredRollDeg - prevRollSetpointCmd;
    if (deltaR > maxDeltaRP)
        deltaR = maxDeltaRP;
    if (deltaR < -maxDeltaRP)
        deltaR = -maxDeltaRP;
    prevRollSetpointCmd += deltaR;

    float deltaP = desiredPitchDeg - prevPitchSetpointCmd;
    if (deltaP > maxDeltaRP)
        deltaP = maxDeltaRP;
    if (deltaP < -maxDeltaRP)
        deltaP = -maxDeltaRP;
    prevPitchSetpointCmd += deltaP;

    // Yaw slew limiting (rate command smoothing)
    float maxDeltaYaw = slewRateYaw * dt; // deg/s change allowed
    float deltaY = desiredYawRate - prevYawRateCmd;
    if (deltaY > maxDeltaYaw)
        deltaY = maxDeltaYaw;
    if (deltaY < -maxDeltaYaw)
        deltaY = -maxDeltaYaw;
    prevYawRateCmd += deltaY;

    if (flightState.mode >= MODE_STABILIZE)
    {
        if (!USE_CASCADED_ANGLE_RATE)
        {
            // Direct angle stabilization (existing behavior)
            rollPID.setpoint = prevRollSetpointCmd;
            pitchPID.setpoint = prevPitchSetpointCmd;
        }
        else
        {
            // Outer angle loop will compute desired rates; set setpoints for rate PIDs later
            rollPID.setpoint = prevRollSetpointCmd;
            pitchPID.setpoint = prevPitchSetpointCmd;
        }
        yawPID.setpoint = prevYawRateCmd; // yaw stays a rate setpoint
    }

    // Altitude hold setpoint maintenance handled elsewhere

    // Throttle gate now only gates integral accumulation; P/D remain active so sliders respond at any throttle
    bool aboveGate = controlInputs.throttle > throttleGate;
    rollPID.allowIntegral = aboveGate;
    pitchPID.allowIntegral = aboveGate;
    yawPID.allowIntegral = aboveGate;

    if (flightState.mode >= MODE_STABILIZE)
    {
        if (!USE_CASCADED_ANGLE_RATE)
        {
            // Original direct angle control path
            rollPID.setMode(true);
            pitchPID.setMode(true);
            yawPID.setMode(true);

            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                rollPID.input = sensorData.roll_angle;
                pitchPID.input = sensorData.pitch_angle;
                yawPID.input = sensorData.yaw_rate;
                xSemaphoreGive(sensorMutex);
            }

            rollPID.compute();
            pitchPID.compute();
            yawPID.compute();
        }
        else
        {
            // Cascaded angle->rate: outer angle PIDs produce desired rates; inner PIDs track actual rates
            rollPID.setMode(true);
            pitchPID.setMode(true);
            yawPID.setMode(true); // yaw still direct rate
            rollRatePID.setMode(true);
            pitchRatePID.setMode(true);

            float rollAngle, pitchAngle, rollRate, pitchRate, yawRate;
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                rollAngle = sensorData.roll_angle;
                pitchAngle = sensorData.pitch_angle;
                rollRate = sensorData.roll_rate;
                pitchRate = sensorData.pitch_rate;
                yawRate = sensorData.yaw_rate;
                xSemaphoreGive(sensorMutex);
            }
            else
            {
                // Fallback to last known inputs in controllers
                rollAngle = rollPID.input;
                pitchAngle = pitchPID.input;
                rollRate = 0;
                pitchRate = 0;
                yawRate = 0;
            }

            rollPID.input = rollAngle;
            pitchPID.input = pitchAngle;
            yawPID.input = yawRate;

            // Outer angle compute to get desired rate commands
            double rollDesiredRate = constrainFloat((float)rollPID.compute(), -MAX_ROLL_PITCH_RATE, MAX_ROLL_PITCH_RATE);
            double pitchDesiredRate = constrainFloat((float)pitchPID.compute(), -MAX_ROLL_PITCH_RATE, MAX_ROLL_PITCH_RATE);

            // Inner rate loop setpoints and inputs
            rollRatePID.setpoint = rollDesiredRate;
            pitchRatePID.setpoint = pitchDesiredRate;
            rollRatePID.input = rollRate;
            pitchRatePID.input = pitchRate;

            rollRatePID.allowIntegral = aboveGate;
            pitchRatePID.allowIntegral = aboveGate;
            rollRatePID.compute();
            pitchRatePID.compute();

            // Map inner loop outputs into original roll/pitch PID outputs for mixer
            rollPID.output = rollRatePID.output;
            pitchPID.output = pitchRatePID.output;
            // Yaw direct
            yawPID.compute();
        }

        // Yaw feed-forward always applies
        if (yawFeedForward != 0.0f)
        {
            double ff = yawFeedForward * yawPID.setpoint; // setpoint in deg/s
            yawPID.output += ff;
            if (yawPID.output > yawPID.outputMax)
                yawPID.output = yawPID.outputMax;
            if (yawPID.output < yawPID.outputMin)
                yawPID.output = yawPID.outputMin;
        }
    }
    else
    {
        rollPID.setMode(false);
        pitchPID.setMode(false);
        yawPID.setMode(false);
        rollPID.output = 0.0;
        pitchPID.output = 0.0;
        yawPID.output = 0.0;
    }

    if (flightState.altitude_hold_active)
    {
        altitudePID.setMode(true);
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
        {
            altitudePID.input = sensorData.altitude_filtered;
            xSemaphoreGive(sensorMutex);
        }
        altitudePID.compute();
    }
}

void mixMotorOutputs()
{
    // 1. Determine base throttle with dynamic headroom (align with droneFreeRTOS behavior)
    // controlInputs.throttle expected 0..1
    float throttleInputNorm = constrainFloat(controlInputs.throttle, 0.0f, 1.0f);

    float baseMicros;
    if (flightState.mode == MODE_MANUAL)
    {
        // Manual: give full usable range (idle..max) directly
        baseMicros = mapFloat(throttleInputNorm, 0.0f, 1.0f, MOTOR_IDLE, MOTOR_MAX);
    }
    else
    {
        // Option B: NO pre-reserved headroom. Use full user throttle range (idle..max) for base.
        // Differential authority is then dynamically scaled inside applyScaledMotorMix.
        baseMicros = mapFloat(throttleInputNorm, 0.0f, 1.0f, MOTOR_IDLE, MOTOR_MAX);

        // Altitude hold additive correction (only if active) applied on top of full-range base.
        if (flightState.altitude_hold_active)
        {
            const float ALT_CORR_MAX = 300.0f;                          // ±300 µs window
            float centeredAlt = (altitudePID.output - 500.0f) / 500.0f; // altitudePID 0..1000 -> -1..+1
            centeredAlt = constrainFloat(centeredAlt, -1.0f, 1.0f);
            baseMicros += centeredAlt * ALT_CORR_MAX;
        }
        // Clamp base after altitude adjustment
        if (baseMicros < MOTOR_IDLE)
            baseMicros = MOTOR_IDLE;
        if (baseMicros > MOTOR_MAX)
            baseMicros = MOTOR_MAX;
    }

