adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    // 2. Prepare control axes (manual inputs or PID outputs depending on mode)
    float Rn = 0.0f, Pn = 0.0f, Yn = 0.0f;
    if (flightState.mode == MODE_MANUAL)
    {
        // Manual: use stick inputs directly normalized (already -1..1 expected)
        // Roll sign: positive roll input tilts right; left roll increases right-side motors
        Rn = constrainFloat((controlInputs.roll) * manualAxisGain, -1.0f, 1.0f);
        Pn = constrainFloat(controlInputs.pitch * manualAxisGain, -1.0f, 1.0f);
        Yn = constrainFloat(controlInputs.yaw * manualAxisGain, -1.0f, 1.0f);
    }
    else
    {
        // Stabilized modes: use PID outputs normalized by gains
        Rn = constrainFloat((float)(rollPID.output / MIX_KR), -1.0f, 1.0f);
        Pn = constrainFloat((float)(pitchPID.output / MIX_KP), -1.0f, 1.0f);
        Yn = constrainFloat((float)(yawPID.output / MIX_KY), -1.0f, 1.0f);
    }

    // 3. Apply unified scaled mixing (handles saturation headroom automatically)
    applyScaledMotorMix(baseMicros, Rn, Pn, Yn);

    // 4. Apply motor calibration offsets AFTER mixing (applies to all modes).
    // Manual mode already applies offsets in the manual path; stabilized uses this path via mixMotorOutputs.
    motorOutputs.motor1 = constrain(motorOutputs.motor1 + (int)motorCal.motor1_offset, MOTOR_MIN, MOTOR_MAX);
    motorOutputs.motor2 = constrain(motorOutputs.motor2 + (int)motorCal.motor2_offset, MOTOR_MIN, MOTOR_MAX);
    motorOutputs.motor3 = constrain(motorOutputs.motor3 + (int)motorCal.motor3_offset, MOTOR_MIN, MOTOR_MAX);
    motorOutputs.motor4 = constrain(motorOutputs.motor4 + (int)motorCal.motor4_offset, MOTOR_MIN, MOTOR_MAX);
}

void outputMotorCommands()
{
    // Output PWM commands to ESCs
    esc1.writeMicroseconds(motorOutputs.motor1);
    esc2.writeMicroseconds(motorOutputs.motor2);
    esc3.writeMicroseconds(motorOutputs.motor3);
    esc4.writeMicroseconds(motorOutputs.motor4);
}

void checkSafetyConditions()
{
    // Check for emergency conditions
    unsigned long now = millis();

    // Initialize battery voltage properly to avoid false alarms
    static bool battery_initialized = false;
    if (!battery_initialized && sensorData.battery_voltage > 9.0)
    {
        battery_initialized = true;
    }

    // Only check command timeout if motors are armed and we've received commands
    // Command timeout temporarily disabled for testing
    // TODO: Re-enable command timeout once web interface sends continuous heartbeat
    // if (flightState.motors_armed && controlInputs.timestamp > 0 && (now - controlInputs.timestamp > 5000))
    // { // 5 second timeout only when armed
    //     flightState.emergency_stop = true;
    //     Serial.println("EMERGENCY: Command timeout!");
    // }

    // Battery safety check disabled - display only
    // TODO: Fix battery voltage reading hardware/software issue
    // if (flightState.motors_armed && battery_initialized && sensorData.battery_voltage > 9.0 && sensorData.battery_percentage < 10.0)
    // {
    //     flightState.emergency_stop = true;
    //     Serial.println("EMERGENCY: Critical battery voltage!");
    // }

    // Check for sensor failures - only if sensors have been initialized and motors are armed
    if (flightState.motors_armed && sensorData.timestamp > 0 && (now - sensorData.timestamp > 500))
    { // 500ms sensor timeout only when armed
        flightState.emergency_stop = true;
        Serial.println("EMERGENCY: Sensor data timeout!");
    }

    // Check for excessive tilt angles - only when armed
    if (flightState.motors_armed && (abs(sensorData.roll_angle) > 60.0 || abs(sensorData.pitch_angle) > 60.0))
    {
        flightState.emergency_stop = true;
        Serial.println("EMERGENCY: Excessive tilt angle!");
    }
}

void handleEmergency()
{
    // Emergency procedure: gradually reduce throttle
    static int emergency_throttle = MOTOR_IDLE;
    static unsigned long last_emergency_update = 0;

    unsigned long now = millis();
    if (now - last_emergency_update > 50)
    { // Update every 50ms
        last_emergency_update = now;

        if (emergency_throttle > MOTOR_ARM_VALUE)
        {
            emergency_throttle -= 5; // Gradually reduce
        }

        // Set all motors to emergency throttle
        motorOutputs.motor1 = emergency_throttle;
        motorOutputs.motor2 = emergency_throttle;
        motorOutputs.motor3 = emergency_throttle;
        motorOutputs.motor4 = emergency_throttle;

        outputMotorCommands();

        // Flash red navigation LEDs during emergency
        static bool led_state = false;
        led_state = !led_state;
        digitalWrite(NAV_BACK_LEFT_RED, led_state);
        digitalWrite(NAV_FRONT_LEFT_RED, led_state);
    }
}

void updateFlightMode()
{
    // Handle arming/disarming
    if (controlInputs.arm_switch && !flightState.motors_armed)
    {
        // Arm motors (safety checks)
        bool throttle_ok = (controlInputs.throttle < 0.1);
        bool level_ok = true;   // Default to OK if no sensor data yet
        bool battery_ok = true; // Default to OK if no battery data yet

        // Only check angles if we have valid sensor data
        if (sensorData.timestamp > 0 && sensorData.valid)
        {
            level_ok = (abs(sensorData.roll_angle) < 30.0 && abs(sensorData.pitch_angle) < 30.0);
        }

        // Battery check disabled for now - display only
        // TODO: Fix battery voltage reading issue
        // if (sensorData.battery_voltage > 9.0)
        // {
        //     battery_ok = (sensorData.battery_percentage > 15.0);
        // }

        if (throttle_ok && level_ok && battery_ok)
        {
            flightState.motors_armed = true;
            flightState.arm_time = millis();
            flightState.mode = MODE_MANUAL;
            flightState.emergency_stop = false;

            Serial.println("Motors ARMED");

            // Visual/audio feedback - use green navigation LEDs
            for (int i = 0; i < 3; i++)
            {
                digitalWrite(NAV_FRONT_RIGHT_GREEN, LOW);
                digitalWrite(NAV_BACK_RIGHT_GREEN, LOW);
                delay(100);
                digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
                digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
                delay(100);
            }

            digitalWrite(BUZZER_PIN, HIGH);
            delay(150);
            digitalWrite(BUZZER_PIN, LOW);
        }
        else
        {
            Serial.println("ARM FAILED: Safety checks failed");
            Serial.printf("Throttle: %.2f, Level: %s, Battery: %s (disabled)\n",
                          controlInputs.throttle,
                          level_ok ? "OK" : "FAIL",
                          battery_ok ? "OK" : "FAIL");
        }
    }
    else if (!controlInputs.arm_switch && flightState.motors_armed)
    {
        // Disarm motors
        flightState.motors_armed = false;
        flightState.mode = MODE_DISARMED;
        flightState.altitude_hold_active = false;

