adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
        // Success beep sequence
        for (int i = 0; i < 3; i++)
        {
            digitalWrite(BUZZER_PIN, HIGH);
            delay(200);
            digitalWrite(BUZZER_PIN, LOW);
            delay(100);
        }

        // Green LED on to indicate successful calibration
        digitalWrite(LED_G1_PIN, HIGH);
        delay(2000);
        digitalWrite(LED_G1_PIN, LOW);
    }
    else
    {
        Serial.println("===== IMU CALIBRATION FAILED =====");
        Serial.printf("Not enough valid samples: %d/%d\n", validSamples, numSamples);
        Serial.println("Check IMU connection and try again.");
        Serial.println("Ensure drone is completely stationary during calibration.");

        // Error beep sequence
        for (int i = 0; i < 5; i++)
        {
            digitalWrite(BUZZER_PIN, HIGH);
            delay(100);
            digitalWrite(BUZZER_PIN, LOW);
            delay(100);
        }

        // Red LED on to indicate failed calibration
        digitalWrite(LED_R1_PIN, HIGH);
        delay(3000);
        digitalWrite(LED_R1_PIN, LOW);
    }

    Serial.println("=====================================");
}

// ================================
// WEB SERVER SETUP
// ================================

void setupWebServer()
{
    // Serve main dashboard
    server.on("/", HTTP_GET, []()
              {
        String html = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <title>ESP32 Drone Flight Controller</title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        body { font-family: Arial, sans-serif; margin: 20px; background: #f0f0f0; }
        .container { max-width: 1200px; margin: 0 auto; }
        .card { background: white; padding: 20px; margin: 10px 0; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); }
        .status { display: flex; flex-wrap: wrap; gap: 10px; }
        .status-item { padding: 10px; border-radius: 4px; color: white; min-width: 100px; text-align: center; }
        .status-armed { background: #4CAF50; }
        .status-disarmed { background: #f44336; }
        .status-manual { background: #ff9800; }
        .status-stabilize { background: #2196F3; }
        .controls { display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 20px; }
        .joystick { text-align: center; padding: 20px; }
        button { padding: 10px 20px; margin: 5px; border: none; border-radius: 4px; cursor: pointer; }
        .btn-primary { background: #2196F3; color: white; }
        .btn-danger { background: #f44336; color: white; }
        .btn-success { background: #4CAF50; color: white; }
        input[type="range"] { width: 100%; }
        .sensor-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(200px, 1fr)); gap: 15px; }
        .sensor-value { padding: 10px; background: #e3f2fd; border-radius: 4px; text-align: center; }
        .emergency { background: #f44336; color: white; font-weight: bold; padding: 15px; border-radius: 8px; }
    </style>
</head>
<body>
    <div class="container">
        <h1>ESP32 Drone Flight Controller</h1>
        
        <!-- Flight Status -->
        <div class="card">
            <h2>Flight Status</h2>
            <div class="status" id="flightStatus">
                <div class="status-item status-disarmed">DISARMED</div>
                <div class="status-item">Manual Mode</div>
            </div>
            <div id="emergencyAlert" style="display: none;" class="emergency">
                WARNING: EMERGENCY MODE ACTIVE - LANDING AUTOMATICALLY
            </div>
        </div>
        
        <!-- Control Interface -->
        <div class="card">
            <h2>Flight Controls</h2>
            <div class="controls">
                <div class="joystick">
                    <h3>Throttle</h3>
                    <input type="range" id="throttle" min="0" max="100" value="0" orient="vertical" oninput="updateControl()">
                    <span id="throttle_val">0%</span>
                </div>
                <div class="joystick">
                    <h3>Roll (Left/Right)</h3>
                    <input type="range" id="roll" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="roll_val">0</span>
                </div>
                <div class="joystick">
                    <h3>Pitch (Forward/Back)</h3>
                    <input type="range" id="pitch" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="pitch_val">0</span>
                </div>
                <div class="joystick">
                    <h3>Yaw (Rotate)</h3>
                    <input type="range" id="yaw" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="yaw_val">0</span>
                </div>
            </div>
            <div style="text-align: center; margin-top: 20px;">
                <button class="btn-success" onclick="armMotors()">ARM MOTORS</button>
                <button class="btn-danger" onclick="disarmMotors()">DISARM MOTORS</button>
                <button class="btn-primary" onclick="toggleFlightMode()">TOGGLE MODE</button>
                <button class="btn-danger" onclick="emergencyStop()">EMERGENCY STOP</button>
            </div>
        </div>
        
        <!-- Sensor Data -->
        <div class="card">
            <h2>Live Sensor Data</h2>
            <div class="sensor-grid" id="sensorData">
                <div class="sensor-value">Roll: 0.0 deg</div>
                <div class="sensor-value">Pitch: 0.0 deg</div>
                <div class="sensor-value">Altitude: 0.0 m</div>
                <div class="sensor-value">Battery: 0.0V</div>
            </div>
        </div>
        
        <!-- Motor Calibration -->
        <div class="card">
            <h2>Motor Calibration (Fix Imbalance)</h2>
            <p style="color: #666; font-size: 14px;">Adjust motor offsets to compensate for mechanical imbalances. Negative values reduce motor power.</p>
            <div class="controls">
                <div>
                    <h3>Motor 1 (Front Right CCW)</h3>
                    <label>Offset: <input type="number" id="motor1_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 2 (Back Right CW)</h3>
                    <label>Offset: <input type="number" id="motor2_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 3 (Front Left CW)</h3>
                    <label>Offset: <input type="number" id="motor3_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 4 (Back Left CCW)</h3>
                    <label>Offset: <input type="number" id="motor4_offset" value="0" step="1" min="-200" max="200" onchange="updateMotorCal()"></label>
                </div>
            </div>
            <div style="text-align: center; margin-top: 15px;">
                <button class="btn-primary" onclick="resetMotorCal()">Reset All to 0</button>
                <button class="btn-success" onclick="saveMotorCal()">Save Calibration</button>
            </div>
        </div>
        
        <!-- PID Tuning -->
        <div class="card">
            <h2>PID Tuning</h2>
            <div class="controls">
                <div>
                    <h3>Roll PID</h3>
                    <label>P: <input type="number" id="roll_p" value="2.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="roll_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="roll_d" value="0.1" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Pitch PID</h3>
                    <label>P: <input type="number" id="pitch_p" value="2.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="pitch_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="pitch_d" value="0.1" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Yaw PID</h3>
                    <label>P: <input type="number" id="yaw_p" value="1.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="yaw_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="yaw_d" value="0.05" step="0.01" onchange="updatePID()"></label><br>
                </div>
            </div>
                        <hr>
                        <h3>Mixer / Control Gains</h3>
                        <div class="controls">
                            <div>
                                <label>Mix KR (Roll): <input type="number" id="mix_kr" value="200" step="5" onchange="updatePID()"></label><br>
                                <label>Mix KP (Pitch): <input type="number" id="mix_kp" value="200" step="5" onchange="updatePID()"></label><br>
                                <label>Mix KY (Yaw): <input type="number" id="mix_ky" value="150" step="5" onchange="updatePID()"></label><br>
                            </div>
                            <div>
                                <label>Manual Axis Gain: <input type="number" id="manual_axis_gain" value="1.30" step="0.05" onchange="updatePID()"></label><br>
                                <label>Throttle Gate: <input type="number" id="throttle_gate" value="0.35" step="0.01" min="0" max="1" onchange="updatePID()"></label><br>
                                <label>Slew Roll/Pitch (deg/s): <input type="number" id="slew_rp" value="120" step="5" onchange="updatePID()"></label><br>
                                <label>Slew Yaw Rate (deg/s/s): <input type="number" id="slew_yaw" value="720" step="10" onchange="updatePID()"></label><br>
                                <label>Yaw Feed-Forward: <input type="number" id="yaw_ff" value="0.10" step="0.01" onchange="updatePID()"></label><br>
                            </div>
                        </div>
                        <hr>
                        <h3>Advanced: Fusion & Cascaded Control</h3>
                        <div class="controls">
                            <div>
                                <label><input type="checkbox" id="use_kalman"> Use Kalman for Roll/Pitch</label><br>
                                <label>Kalman Rate Std (deg/s): <input type="number" id="kalman_rate_std" value="4.0" step="0.5" onchange="updatePID()"></label><br>
                                <label>Kalman Meas Std (deg): <input type="number" id="kalman_meas_std" value="3.0" step="0.5" onchange="updatePID()"></label><br>
                            </div>
                            <div>
                                <label><input type="checkbox" id="use_cascaded"> Use Cascaded Angle→Rate</label><br>
                                <label>Max Roll/Pitch Rate (deg/s): <input type="number" id="max_rp_rate" value="180" step="10" onchange="updatePID()"></label><br>
                                <label>Rate Roll P: <input type="number" id="rate_roll_p" value="0.10" step="0.01" onchange="updatePID()"></label>
                                <label>I: <input type="number" id="rate_roll_i" value="0.02" step="0.01" onchange="updatePID()"></label>
                                <label>D: <input type="number" id="rate_roll_d" value="0.002" step="0.001" onchange="updatePID()"></label><br>
                                <label>Rate Pitch P: <input type="number" id="rate_pitch_p" value="0.10" step="0.01" onchange="updatePID()"></label>
                                <label>I: <input type="number" id="rate_pitch_i" value="0.02" step="0.01" onchange="updatePID()"></label>
                                <label>D: <input type="number" id="rate_pitch_d" value="0.002" step="0.001" onchange="updatePID()"></label>
                            </div>
                        </div>
        </div>
        
