adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
                        // Yaw PID components
                        html += `<div style="color: #00ffff;">Yaw P: ${data.pid.yaw_p >= 0 ? '+' : ''}${data.pid.yaw_p.toFixed(1)} | I: ${data.pid.yaw_i >= 0 ? '+' : ''}${data.pid.yaw_i.toFixed(1)} | D: ${data.pid.yaw_d >= 0 ? '+' : ''}${data.pid.yaw_d.toFixed(1)}`;
                        if (data.pid.yaw_sat) html += ' | <span style="color: #ff6600;">OUT-SAT</span>';
                        if (data.pid.yaw_i_sat) html += ' | <span style="color: #ff6600;">I-SAT</span>';
                        html += '</div>';
                        
                        html += `<div>PID Status: ${data.pid.enabled_by_throttle ? '<span style="color: #00ff00;">ACTIVE</span>' : '<span style="color: #ff6600;">THROTTLE DEADBAND</span>'} (Min throttle: 30% for control)</div>`;
                        html += '<div style="color: #00ff00;">Features: Anti-windup, Derivative Filtering, Setpoint Smoothing</div>';
                        html += '<br>';
                    }
                    
                    // [Calibration] Section - show calibration offsets
                    if (data.calibration && data.calibration.active) {
                        html += '<div style="color: #ffff00;">[Calibration]</div>';
                        html += `<div>IMU Level Offsets -> Roll: ${data.calibration.roll_offset >= 0 ? '+' : ''}${data.calibration.roll_offset.toFixed(2)}° | Pitch: ${data.calibration.pitch_offset >= 0 ? '+' : ''}${data.calibration.pitch_offset.toFixed(2)}°</div>`;
                        html += '<div>Current angles are relative to these calibrated level positions</div>';
                        html += '<br>';
                    }
                    
                    // [Motor Mix] Section
                    html += '<div style="color: #ffff00;">[Motor Mix]</div>';
                    html += `<div>BasePWM: ${data.motors.base_pwm} -> Motors: [${data.motors.motor1}, ${data.motors.motor2}, ${data.motors.motor3}, ${data.motors.motor4}]</div>`;
                    html += `<div>Calibration: [${data.motors.cal1 >= 0 ? '+' : ''}${data.motors.cal1.toFixed(0)}, ${data.motors.cal2 >= 0 ? '+' : ''}${data.motors.cal2.toFixed(0)}, ${data.motors.cal3 >= 0 ? '+' : ''}${data.motors.cal3.toFixed(0)}, ${data.motors.cal4 >= 0 ? '+' : ''}${data.motors.cal4.toFixed(0)}]</div>`;
                    html += '<br>';
                    
                    // [Inputs] Section
                    html += '<div style="color: #ffff00;">[Inputs]</div>';
                    html += `<div>Throttle: ${data.inputs.throttle.toFixed(3)} | Roll: ${data.inputs.roll >= 0 ? '+' : ''}${data.inputs.roll.toFixed(2)} | Pitch: ${data.inputs.pitch >= 0 ? '+' : ''}${data.inputs.pitch.toFixed(2)} | Yaw: ${data.inputs.yaw >= 0 ? '+' : ''}${data.inputs.yaw.toFixed(2)}</div>`;
                    html += '<br>';
                    
                    // [System] Section
                    html += '<div style="color: #ffff00;">[System]</div>';
                    html += `<div>Loop Freq: 100Hz | Sensors: ${data.system.sensors_ok ? 'OK' : 'FAIL'} | Emergency: ${data.system.emergency ? 'YES' : 'NO'}</div>`;
                    html += `<div>IMU Calibrated: ${data.system.imu_calibrated ? 'YES' : 'NO'} | Uptime: ${data.system.uptime} ms | Free Heap: ${data.system.free_heap} bytes</div>`;
                    
                    content.innerHTML = html;
                    
                    // Auto-scroll to bottom if needed
                    const console = document.getElementById('debugConsole');
                    console.scrollTop = console.scrollHeight;
                })
                .catch(error => {
                    console.log('Debug update error:', error);
                    const content = document.getElementById('debugContent');
                    content.innerHTML = '<div style="color: #ff0000;">Debug data unavailable - Check connection</div>';
                });
        }
        
        function toggleDebugConsole() {
            debugUpdateEnabled = !debugUpdateEnabled;
            const button = event.target;
            if (debugUpdateEnabled) {
                button.textContent = 'Pause Updates';
                button.className = 'btn-danger';
                startDebugUpdates();
            } else {
                button.textContent = 'Resume Updates';
                button.className = 'btn-success';
                if (debugUpdateInterval) {
                    clearInterval(debugUpdateInterval);
                    debugUpdateInterval = null;
                }
            }
        }
        
        function clearDebugConsole() {
            const content = document.getElementById('debugContent');
            content.innerHTML = '<div style="color: #00ff00;">Debug console cleared - waiting for new data...</div>';
        }
        
        // Start debug updates when page loads
        startDebugUpdates();
    </script>
</body>
</html>
)rawliteral";
        server.send(200, "text/html", html); });

    // API: Flight data endpoint
    server.on("/api/flight_data", HTTP_GET, []()
              {
        StaticJsonDocument<1024> doc;
        
        // Flight status
        JsonObject status = doc.createNestedObject("status");
        status["armed"] = flightState.motors_armed;
        status["mode"] = (flightState.mode == MODE_MANUAL) ? "MANUAL" : 
                       (flightState.mode == MODE_STABILIZE) ? "STABILIZE" : "DISARMED";
        status["altitude_hold"] = flightState.altitude_hold_active;
        status["emergency"] = flightState.emergency_stop;
        
        // Sensor data
        JsonObject sensors = doc.createNestedObject("sensors");
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            sensors["roll"] = sensorData.roll_angle;
            sensors["pitch"] = sensorData.pitch_angle;
            sensors["yaw_rate"] = sensorData.yaw_rate;
            sensors["altitude"] = sensorData.altitude_filtered;
            sensors["battery_voltage"] = sensorData.battery_voltage;
            sensors["battery_percentage"] = sensorData.battery_percentage;
            sensors["satellites"] = sensorData.satellites;
            xSemaphoreGive(sensorMutex);
        }
        
        // Motor outputs
        sensors["motor1"] = motorOutputs.motor1;
        sensors["motor2"] = motorOutputs.motor2;
        sensors["motor3"] = motorOutputs.motor3;
        sensors["motor4"] = motorOutputs.motor4;
        
        String response;
        serializeJson(doc, response);
        server.send(200, "application/json", response); });

    // API: Control input endpoint
    server.on("/api/control", HTTP_POST, []()
              {
        if (!server.hasArg("plain")) {
            server.send(400, "text/plain", "No data");
            return;
        }
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, server.arg("plain"));
        if (err) {
            server.send(400, "text/plain", "Bad JSON");
            return;
        }
        auto getNorm = [](JsonVariant v, float defVal, float minV, float maxV){
            if (v.isNull()) return defVal;
            float f = v.as<float>();
            if (isnan(f)) return defVal;
            if (f < minV) f = minV; else if (f > maxV) f = maxV;
            return f;
        };
        controlInputs.throttle = getNorm(doc["throttle"], 0.0f, 0.0f, 1.0f);
        controlInputs.roll     = getNorm(doc["roll"],     0.0f, -1.0f, 1.0f);
        controlInputs.pitch    = getNorm(doc["pitch"],    0.0f, -1.0f, 1.0f);
        controlInputs.yaw      = getNorm(doc["yaw"],      0.0f, -1.0f, 1.0f);
        controlInputs.timestamp = millis();

        static int control_debug_counter = 0;
        if (++control_debug_counter >= 20) { // ~1s
            control_debug_counter = 0;
            Serial.printf("Web Control Input - Thr: %.2f R: %.2f P: %.2f Y: %.2f (gate %.2f)\n",
                          controlInputs.throttle, controlInputs.roll, controlInputs.pitch, controlInputs.yaw, throttleGate);
        }
        server.send(200, "text/plain", "OK"); });

    // API: Arm motors
    server.on("/api/arm", HTTP_POST, []()
              {
        Serial.println("ARM button pressed via web interface");
        controlInputs.arm_switch = true;
        controlInputs.timestamp = millis();
        Serial.printf("Control inputs updated - arm_switch: %s, timestamp: %lu\n", 
                     controlInputs.arm_switch ? "true" : "false", 
                     controlInputs.timestamp);
        server.send(200, "text/plain", "Arm command sent"); });

    // API: Disarm motors
    server.on("/api/disarm", HTTP_POST, []()
              {
        Serial.println("DISARM button pressed via web interface");
        controlInputs.arm_switch = false;
        controlInputs.timestamp = millis();
        Serial.printf("Control inputs updated - arm_switch: %s, timestamp: %lu\n", 
                     controlInputs.arm_switch ? "true" : "false", 
                     controlInputs.timestamp);
        server.send(200, "text/plain", "Disarm command sent"); });

    // API: Toggle flight mode
    server.on("/api/toggle_mode", HTTP_POST, []()
              {
        Serial.println("TOGGLE MODE button pressed via web interface");
        controlInputs.mode_switch = !controlInputs.mode_switch;
        controlInputs.timestamp = millis();
        Serial.printf("Mode switch toggled to: %s\n", 
                     controlInputs.mode_switch ? "true" : "false");
        server.send(200, "text/plain", "Mode toggled"); });

