adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
    // API: Emergency stop
    server.on("/api/emergency", HTTP_POST, []()
              {
        flightState.emergency_stop = true;
        Serial.println("EMERGENCY STOP ACTIVATED via web interface!");
        server.send(200, "text/plain", "Emergency stop activated"); });

    // API: Update PID parameters
    server.on("/api/pid_update", HTTP_POST, []()
              {
        if (server.hasArg("plain")) {
            StaticJsonDocument<768> doc;
            deserializeJson(doc, server.arg("plain"));
            
            // Update PID parameters
            pidParams.roll_kp = doc["roll_p"];
            pidParams.roll_ki = doc["roll_i"];
            pidParams.roll_kd = doc["roll_d"];
            pidParams.pitch_kp = doc["pitch_p"];
            pidParams.pitch_ki = doc["pitch_i"];
            pidParams.pitch_kd = doc["pitch_d"];
            pidParams.yaw_kp = doc["yaw_p"];
            pidParams.yaw_ki = doc["yaw_i"];
            pidParams.yaw_kd = doc["yaw_d"];
            // Extended mixer / control constants (live tuning)
            if (doc.containsKey("mix_kr")) MIX_KR = doc["mix_kr"]; 
            if (doc.containsKey("mix_kp")) MIX_KP = doc["mix_kp"]; 
            if (doc.containsKey("mix_ky")) MIX_KY = doc["mix_ky"]; 
            if (doc.containsKey("manual_axis_gain")) manualAxisGain = doc["manual_axis_gain"].as<float>();
            if (doc.containsKey("throttle_gate"))    throttleGate   = doc["throttle_gate"].as<float>();
            if (doc.containsKey("slew_rp"))          slewRateRP     = doc["slew_rp"].as<float>();
            if (doc.containsKey("slew_yaw"))         slewRateYaw    = doc["slew_yaw"].as<float>();
            if (doc.containsKey("yaw_ff"))           yawFeedForward = doc["yaw_ff"].as<float>();
            
            // Apply to custom PID controllers
            rollPID.setTunings(pidParams.roll_kp, pidParams.roll_ki, pidParams.roll_kd);
            pitchPID.setTunings(pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd);
            yawPID.setTunings(pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd);
            
            // Advanced fusion/control toggles and parameters
            if (doc.containsKey("use_kalman")) {
                USE_KALMAN_ATTITUDE = doc["use_kalman"].as<bool>();
            }
            if (doc.containsKey("kalman_rate_std")) KALMAN_RATE_STD = doc["kalman_rate_std"].as<float>();
            if (doc.containsKey("kalman_meas_std")) KALMAN_MEAS_STD = doc["kalman_meas_std"].as<float>();

            if (doc.containsKey("use_cascaded")) {
                USE_CASCADED_ANGLE_RATE = doc["use_cascaded"].as<bool>();
            }
            if (doc.containsKey("max_rp_rate")) MAX_ROLL_PITCH_RATE = doc["max_rp_rate"].as<float>();
            if (doc.containsKey("rate_roll_p")) ratePidParams.roll_kp = doc["rate_roll_p"].as<double>();
            if (doc.containsKey("rate_roll_i")) ratePidParams.roll_ki = doc["rate_roll_i"].as<double>();
            if (doc.containsKey("rate_roll_d")) ratePidParams.roll_kd = doc["rate_roll_d"].as<double>();
            if (doc.containsKey("rate_pitch_p")) ratePidParams.pitch_kp = doc["rate_pitch_p"].as<double>();
            if (doc.containsKey("rate_pitch_i")) ratePidParams.pitch_ki = doc["rate_pitch_i"].as<double>();
            if (doc.containsKey("rate_pitch_d")) ratePidParams.pitch_kd = doc["rate_pitch_d"].as<double>();

            // Apply to inner rate PIDs
            rollRatePID.setTunings(ratePidParams.roll_kp, ratePidParams.roll_ki, ratePidParams.roll_kd);
            pitchRatePID.setTunings(ratePidParams.pitch_kp, ratePidParams.pitch_ki, ratePidParams.pitch_kd);
            
            Serial.println("PID parameters updated");
            server.send(200, "text/plain", "PID updated");
        } else {
            server.send(400, "text/plain", "No data");
        } });

    // API: Update Motor Calibration
    server.on("/api/motor_calibration", HTTP_POST, []()
              {
        if (server.hasArg("plain")) {
            StaticJsonDocument<256> doc;
            deserializeJson(doc, server.arg("plain"));
            
            // Update motor calibration offsets
            motorCal.motor1_offset = doc["motor1_offset"];
            motorCal.motor2_offset = doc["motor2_offset"];
            motorCal.motor3_offset = doc["motor3_offset"];
            motorCal.motor4_offset = doc["motor4_offset"];
            
            Serial.printf("Motor calibration updated - M1: %.1f, M2: %.1f, M3: %.1f, M4: %.1f\n",
                         motorCal.motor1_offset, motorCal.motor2_offset,
                         motorCal.motor3_offset, motorCal.motor4_offset);
            server.send(200, "text/plain", "Motor calibration updated");
        } else {
            server.send(400, "text/plain", "No data");
        } });

    // API: Debug Data for Web Dashboard
    server.on("/api/debug", HTTP_GET, []()
              {
        StaticJsonDocument<1024> doc;
        
        // Status Section
        doc["status"]["mode"] = debugData.flight_mode;
        doc["status"]["armed"] = debugData.armed;
        doc["status"]["throttle"] = debugData.throttle_input;
        doc["status"]["throttle_pwm"] = debugData.throttle_pwm;
        doc["status"]["roll"] = debugData.roll_angle;
        doc["status"]["pitch"] = debugData.pitch_angle;
        doc["status"]["yaw_rate"] = debugData.yaw_rate;
        doc["status"]["altitude"] = debugData.altitude;
        doc["status"]["battery"] = debugData.battery_voltage;
        
        // PID Debug Section - Enhanced with custom PID diagnostics
        doc["pid"]["active"] = debugData.pid_active;
        doc["pid"]["enabled_by_throttle"] = debugData.pid_enabled_by_throttle;
        doc["pid"]["roll_output"] = debugData.roll_output;
        doc["pid"]["pitch_output"] = debugData.pitch_output;
        doc["pid"]["yaw_output"] = debugData.yaw_output;
        doc["pid"]["roll_setpoint"] = debugData.roll_setpoint;
        doc["pid"]["pitch_setpoint"] = debugData.pitch_setpoint;
        doc["pid"]["yaw_setpoint"] = debugData.yaw_setpoint;
        
        // Advanced PID Diagnostics - Individual P, I, D components
        doc["pid"]["roll_p"] = debugData.roll_proportional;
        doc["pid"]["roll_i"] = debugData.roll_integral;
        doc["pid"]["roll_d"] = debugData.roll_derivative;
        doc["pid"]["roll_sat"] = debugData.roll_output_saturated;
        doc["pid"]["roll_i_sat"] = debugData.roll_integral_saturated;
        
        doc["pid"]["pitch_p"] = debugData.pitch_proportional;
        doc["pid"]["pitch_i"] = debugData.pitch_integral;
        doc["pid"]["pitch_d"] = debugData.pitch_derivative;
        doc["pid"]["pitch_sat"] = debugData.pitch_output_saturated;
        doc["pid"]["pitch_i_sat"] = debugData.pitch_integral_saturated;
        
