adithyadilum/esp32-flight-controller/firmware/development/drone/flight_controller-v2.cpp
        doc["pid"]["yaw_p"] = debugData.yaw_proportional;
        doc["pid"]["yaw_i"] = debugData.yaw_integral;
        doc["pid"]["yaw_d"] = debugData.yaw_derivative;
        doc["pid"]["yaw_sat"] = debugData.yaw_output_saturated;
        doc["pid"]["yaw_i_sat"] = debugData.yaw_integral_saturated;
        
        // Calibration Debug Section
        doc["calibration"]["active"] = debugData.imu_cal_active;
        doc["calibration"]["roll_offset"] = debugData.roll_cal_offset;
        doc["calibration"]["pitch_offset"] = debugData.pitch_cal_offset;
        
        // Motor Mix Section
        doc["motors"]["base_pwm"] = debugData.base_pwm;
        doc["motors"]["motor1"] = debugData.motor1_final;
        doc["motors"]["motor2"] = debugData.motor2_final;
        doc["motors"]["motor3"] = debugData.motor3_final;
        doc["motors"]["motor4"] = debugData.motor4_final;
        doc["motors"]["cal1"] = debugData.motor1_offset;
        doc["motors"]["cal2"] = debugData.motor2_offset;
        doc["motors"]["cal3"] = debugData.motor3_offset;
        doc["motors"]["cal4"] = debugData.motor4_offset;
        
        // Inputs Section
        doc["inputs"]["throttle"] = debugData.throttle_input;
        doc["inputs"]["roll"] = debugData.roll_input;
        doc["inputs"]["pitch"] = debugData.pitch_input;
        doc["inputs"]["yaw"] = debugData.yaw_input;
        
        // System Section
        doc["system"]["sensors_ok"] = debugData.sensors_ok;
        doc["system"]["emergency"] = debugData.emergency_active;
        doc["system"]["imu_calibrated"] = debugData.imu_calibrated;
        doc["system"]["uptime"] = debugData.uptime;
        doc["system"]["free_heap"] = debugData.free_heap;
        doc["system"]["timestamp"] = debugData.timestamp;
        
        String response;
        serializeJson(doc, response);
        server.send(200, "application/json", response); });

    server.begin();
    Serial.println("Web server started - Flight Controller Dashboard ready");
}

// ================================
// LED CONTROL FUNCTIONS
// ================================

void initializeLEDs()
{
    // Initialize navigation LED pins
    pinMode(NAV_FRONT_RIGHT_GREEN, OUTPUT);
    pinMode(NAV_BACK_RIGHT_GREEN, OUTPUT);
    pinMode(NAV_BACK_LEFT_RED, OUTPUT);
    pinMode(NAV_FRONT_CENTER_WHITE, OUTPUT);
    pinMode(NAV_FRONT_LEFT_RED, OUTPUT);
    pinMode(NAV_BACK_CENTER_WHITE, OUTPUT);

    // Turn on navigation lights immediately (always on when powered)
    digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
    digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
    digitalWrite(NAV_BACK_LEFT_RED, HIGH);
    digitalWrite(NAV_FRONT_LEFT_RED, HIGH);

    // Center white LEDs start off (controlled by status)
    digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
    digitalWrite(NAV_BACK_CENTER_WHITE, LOW);

    Serial.println("Navigation LEDs initialized");
}

void updateNavigationLights()
{
    // Nav lights (Red/Green) are always ON during powered-on state
    // This helps identify orientation at night (Red = left, Green = right)
    static bool nav_lights_on = true;

    if (nav_lights_on)
    {
        digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
        digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
        digitalWrite(NAV_BACK_LEFT_RED, HIGH);
        digitalWrite(NAV_FRONT_LEFT_RED, HIGH);
    }
}

void updateStatusLights()
{
    static unsigned long last_blink_time = 0;
    static bool blink_state = false;
    unsigned long now = millis();

    // Center white LEDs behavior based on flight state
    if (!flightState.motors_armed)
    {
        // Arming Blink: Slow blink when waiting to arm (1Hz)
        if (now - last_blink_time > 500)
        {
            last_blink_time = now;
            blink_state = !blink_state;
            digitalWrite(NAV_FRONT_CENTER_WHITE, blink_state);
            digitalWrite(NAV_BACK_CENTER_WHITE, blink_state);
        }
    }
    else
    {
        // Flight Mode On: Solid light when armed
        digitalWrite(NAV_FRONT_CENTER_WHITE, HIGH);
        digitalWrite(NAV_BACK_CENTER_WHITE, HIGH);

        // Optional: Throttle Sync Pulse - Flash intensity reflects throttle level
        setThrottlePulse(controlInputs.throttle);
    }
}

void setThrottlePulse(float throttle_percentage)
{
    // Optional throttle sync pulse feature
    // Flash the center white LEDs with intensity reflecting throttle level
    static unsigned long last_pulse_time = 0;
    static bool pulse_state = false;
    unsigned long now = millis();

    // Only pulse if throttle is above minimum and motors are armed
    if (flightState.motors_armed && throttle_percentage > 0.05)
    {
        // Pulse frequency increases with throttle (10Hz to 50Hz)
        int pulse_interval = map(throttle_percentage * 100, 5, 100, 100, 20);

        if (now - last_pulse_time > pulse_interval)
        {
            last_pulse_time = now;
            pulse_state = !pulse_state;

            // Brief flash to indicate throttle activity
            if (pulse_state)
            {
                digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
                digitalWrite(NAV_BACK_CENTER_WHITE, LOW);
            }
            else
            {
                digitalWrite(NAV_FRONT_CENTER_WHITE, HIGH);
                digitalWrite(NAV_BACK_CENTER_WHITE, HIGH);
            }
        }
    }
}
